clc, clear all, close all

P8 = readmatrix('P8.txt');
P16 = readmatrix('P16.txt');
P32 = readmatrix('P32.txt');
P64 = readmatrix('P64.txt');
%P = [P8, P13];
SNR = 10;
%P8 0.6598,0.5055,0.3721,0.2496,0.1829,0.12,0.0827,0.0518,0.0389,0.0241,0.0153
%Р16 0.3756,0.2319,0.1383,0.0862,0.0542,0.0359,0.0245,0.012,0.0071,0.0046,0.0019
%P32 0.1005,0.0569,0.0353,0.0225,0.0148,0.00850000000000001,0.0031,0.001,0.0007,0.0002,0.0001
%P64 0.0222,0.0126,0.00850000000000001,0.0037,0.0016,0.0005,0.0002,0.0001,0,0,0

%P8 0.5,0.4055,0.2721,0.1496,0.0829,0.07,0.0527,0.0318,0.0269,0.0141,0.0053
%Р16 0.2756,0.2319,0.1583,0.0962,0.0542,0.0359,0.0245,0.012,0.0071,0.0046,0.0019
%P32 0.1605,0.1269, 0.1012, 0.0853, 0.061, 0.0225,0.0148,0.00850000000000001,0.0045, 0.0031,0.001,0.0007,0.0001,0
%P64 0.0272, 0.0209, 0.0178,0.0123, 0.00850000000000001, 0.0054, 0.0037,0.0016,0.0012,0.0008,0.0003,0,0,0
figure
semilogy(0:SNR, P8,'LineWidth', 2);
hold on;
grid on;
semilogy(0:SNR, P16,'LineWidth', 2);
hold on;
grid on;
semilogy(0:SNR, P32,'LineWidth', 2);
hold on;
grid on;
semilogy(0:SNR, P64,'LineWidth', 2);
xlabel('Отношение сигнал/шум (SNR), dB', 'FontName', 'Times New Roman', 'FontSize', 18);
ylabel('Зависимость битовой ошибки (BER)', 'FontName', 'Times New Roman', 'FontSize', 18);
legend('64 канала', '32 канала', '16 каналов','8 каналов' )